# ExportLayerKey Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLayerKey Class
Members See Also
---
A key used to represent an item stored in an ExportLayerTable.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class ExportLayerKey : IDisposable
```

Visual Basic
---
```text
Public Class ExportLayerKey _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ExportLayerKey : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ExportLayerKey
# See Also
ExportLayerKey Members
Autodesk.Revit.DB Namespace